Repository: rw417/Writingway
Catalog: assets/locale/*/LC_MESSAGES/writingway.po
Languages: ru

source: Search Results
ru: Результаты поиска

source: Invalid regex pattern
ru: Недопустимый шаблон регулярного выражения

source: Match not found; content may have changed
ru: Совпадение не найдено; содержимое могло измениться

source: Please select a match to replace
ru: Пожалуйста, выберите совпадение для замены

source: Match position is invalid; content may have changed
ru: Позиция совпадения недействительна; содержимое могло измениться

source: Match text does not match; content may have changed
ru: Текст совпадения не соответствует; содержимое могло измениться

source: Replaced 1 match
ru: Заменено 1 совпадение

source: Replaced {} matches
ru: Заменено {} совпадений

source: Invalid position for undo
ru: Недопустимая позиция для отмены

source: Undone 1 replacement
ru: Отменена 1 замена

source: AI Compendium Analysis
ru: Анализ компендиума ИИ

source: New
ru: Новый

source: Select an entry or relationship to view or edit its details.
ru: Выберите запись или отношение для просмотра или редактирования деталей.

source: Current
ru: Текущий

source: Existing compendium entry will appear here.
ru: Существующая запись компендиума появится здесь.

source: Save to Compendium
ru: Сохранить в компендиум

source: Relationships
ru: Отношения

source: Relationships:
ru: Отношения:

source: Content: {} Relationships:
ru: Содержимое: {} Отношения:

source: None
ru: Нет

source: This entry does not exist in the compendium yet.
ru: Эта запись еще не существует в компендиуме.

source: Relationships:
ru: Отношения:

source: Edit the relationship type for {} (e.g., '{}: Trusted Friend').
ru: Редактировать тип отношения для {} (например, '{}: Доверенный друг').

source: Restore
ru: Восстановить

source: Ignore Update
ru: Игнорировать обновление

source: Rename Entry
ru: Переименовать запись

source: Move To...
ru: Переместить в...

source: Restore Relationship
ru: Восстановить отношение

source: Remove Relationship
ru: Удалить отношение

source: Rename Relationship
ru: Переименовать отношение

source: New name:
ru: Новое имя:

source: {} Relationships:
ru: {} Отношения:

source: Content:
ru: Содержимое:

source: Failed to save: {}
ru: Не удалось сохранить: {}

source: Enhanced Compendium - {}
ru: Улучшенный компендиум - {}

source: Project Toolbar
ru: Панель инструментов проекта

source: <b>Project:</b>
ru: <b>Проект:</b>

source: Search entries and tags...
ru: Поиск записей и тегов...

source: No entry selected
ru: Запись не выбрана

source: Save Changes
ru: Сохранить изменения

source: This is the text the AI can see if you select this entry to be included in the prompt inside the context panel
ru: Это текст, который ИИ может видеть, если вы выберете эту запись для включения в подсказку в панели контекста

source: Overview
ru: Обзор

source: this is the text the AI can see if you select this entry to be included in the prompt inside the context panel
ru: это текст, который ИИ может видеть, если вы выберете эту запись для включения в подсказку в панели контекста

source: Enter details about your entry here... (details about your entry the AI can't see - this info is only for you)
ru: Введите детали о вашей записи здесь... (детали о вашей записи, которые ИИ не видит - эта информация только для вас)

source: Details
ru: Детали

source: details about your entry the AI can't see - this info is only for you
ru: детали о вашей записи, которые ИИ не видит - эта информация только для вас

source: Add Relationship
ru: Добавить отношение

source: Friend
ru: Друг

source: Family
ru: Семья

source: Ally
ru: Союзник

source: Enemy
ru: Враг

source: Acquaintance
ru: Знакомый

source: Other
ru: Другое

source: Related Entry:
ru: Связанная запись:

source: Relationship Type:
ru: Тип отношения:

source: Entry
ru: Запись

source: Relationship Type
ru: Тип отношения

source: details about relationships between entries, not visible to the AI
ru: детали об отношениях между записями, невидимые для ИИ

source: Add Image
ru: Добавить изображение

source: Remove Selected
ru: Удалить выбранное

source: Images
ru: Изображения

source: add images for your entries - not visible to the AI
ru: добавляйте изображения для ваших записей - невидимые для ИИ

source: Tags
ru: Теги

source: Add new tag...
ru: Добавить новый тег...

source: add a tag to your entry
ru: добавить тег к вашей записи

source: Failed to create default compendium file: {}
ru: Не удалось создать файл компендиума по умолчанию: {}

source: Failed to load compendium data: {}
ru: Не удалось загрузить данные компендиума: {}

source: New Category
ru: Новая категория

source: New Entry
ru: Новая запись

source: Delete Category
ru: Удалить категорию

source: Rename Category
ru: Переименовать категорию

source: Save Entry
ru: Сохранить запись

source: Delete Entry
ru: Удалить запись

source: Remove Tag
ru: Удалить тег

source: Select Tag Color
ru: Выбрать цвет тега

source: right-click to move the tag within this list - this impacts the colour of your entry
ru: щелкните правой кнопкой мыши, чтобы переместить тег в этом списке - это влияет на цвет вашей записи

source: Select Image
ru: Выбрать изображение

source: Failed to copy image: {}
ru: Не удалось скопировать изображение: {}

source: Failed to save compendium data: {}
ru: Не удалось сохранить данные компендиума: {}

source: Category name:
ru: Имя категории:

source: Entry name:
ru: Имя записи:

source: Are you sure you want to delete the category '{}' and all its entries?
ru: Вы уверены, что хотите удалить категорию '{}' и все ее записи?

source: Are you sure you want to delete the entry '{}'?
ru: Вы уверены, что хотите удалить запись '{}'?

source: Rename {}
ru: Переименовать {}

source: Backstory Builder for {}
ru: Конструктор предыстории для {}

source: Failed to load backstory_templates.json. Using default template.
ru: Не удалось загрузить backstory_templates.json. Используется шаблон по умолчанию.

source: Character Type:
ru: Тип персонажа:

source: AI-generated or summarized backstory...
ru: Предыстория, сгенерированная или суммированная ИИ...

source: Generate Backstory
ru: Сгенерировать предысторию

source: Describe custom {}...
ru: Опишите пользовательский {}...

source: Custom
ru: Пользовательский

source: No prompt selected.
ru: Подсказка не выбрана.

source: Prompt template missing required variable: {}
ru: В шаблоне подсказки отсутствует обязательная переменная: {}

source: Failed to generate backstory: {}
ru: Не удалось сгенерировать предысторию: {}

source: Open Enhanced Compendium
ru: Открыть улучшенный компендиум

source: Analyze Scene with AI
ru: Анализировать сцену с помощью ИИ

source: Enhanced Compendium window not available.
ru: Окно улучшенного компендиума недоступно.

source: No scene content available to analyze.
ru: Нет содержимого сцены для анализа.

source: AI returned invalid JSON that could not be repaired.
ru: ИИ вернул недопустимый JSON, который не удалось исправить.

source: AI returned invalid JSON format.
ru: ИИ вернул недопустимый формат JSON.

source: Failed to analyze scene: {}
ru: Не удалось проанализировать сцену: {}

source: Success
ru: Успех

source: Compendium updated successfully.
ru: Компендиум успешно обновлен.

source: Failed to save compendium: {}
ru: Не удалось сохранить компендиум: {}

source: Missing Dependencies
ru: Отсутствуют зависимости

source: The application requires the following module(s):
ru: Приложению требуются следующие модули:

source: Please install them by running: pip install
ru: Пожалуйста, установите их, выполнив: pip install

source: On Windows: Win+R to open a console, then type cmd.
ru: В Windows: Win+R, чтобы открыть консоль, затем введите cmd.
