Repository: rw417/Writingway
Catalog: assets/locale/*/LC_MESSAGES/writingway.po
Languages: ru

source: Edit Provider
ru: Редактировать провайдера

source: New Provider
ru: Новый провайдер

source: Provider Details
ru: Детали провайдера

source: Provider
ru: Провайдер

source: Provider Information
ru: Информация о провайдере и модели

source: Name
ru: Имя

source: Endpoint URL
ru: URL-адрес конечной точки

source: Leave empty for default
ru: Оставьте пустым для значения по умолчанию

source: Endpoint URL Help
ru: Справка по URL-адресу конечной точки

source: Override URL for provider Only use if you have a proxy server or a Custom provider. Leave empty for default URL. Ex: 'https://localhost:1234/v1'
ru: Переопределить URL-адрес для провайдера Используйте только если у вас есть прокси-сервер или собственный провайдер. Оставьте пустым для URL по умолчанию. Пример: 'https://localhost:1234/v1'

source: Model
ru: Модель

source: Refresh Model List
ru: Обновить список моделей

source: API Key
ru: Ключ API

source: Reveal
ru: Показать

source: Timeout (seconds)
ru: Тайм-аут (секунды)

source: Default Provider
ru: Провайдер по умолчанию

source: Test
ru: Тест

source: Update
ru: Обновить

source: Add
ru: Добавить

source: Close
ru: Закрыть

source: Error
ru: Ошибка

source: API Key Required
ru: Требуется ключ API

source: Hide
ru: Скрыть

source: Test Result
ru: Результат теста

source: Connection successful!
ru: Соединение успешно!

source: Connection failed. Check provider settings.
ru: Соединение не удалось. Проверьте настройки провайдера.

source: Connection failed: {}
ru: Соединение не удалось: {}

source: Preferences
ru: Настройки

source: General
ru: Общее

source: Appearance
ru: Внешний вид

source: Providers
ru: Провайдеры

source: Save
ru: Сохранить

source: Fast Text to Speech
ru: Быстрый текст в речь

source: Enable Auto-Save
ru: Включить автосохранение

source: Show Random Quotes
ru: Показывать случайные цитаты

source: Enable Debug Logging
ru: Включить отладочное логирование

source: Language
ru: Язык

source: Theme
ru: Тема

source: Background Color
ru: Цвет фона

source: Text Size
ru: Размер текста

source: Sample Text
ru: Пример текста

source: Configured Providers
ru: Настроенные провайдеры

source: Edit
ru: Редактировать

source: Delete
ru: Удалить

source: Warning
ru: Предупреждение

source: Provider name cannot be empty.
ru: Имя провайдера не может быть пустым.

source: Confirm Deletion
ru: Подтвердите удаление

source: Are you sure you want to delete the selected provider?
ru: Вы уверены, что хотите удалить выбранного провайдера?

source: Save Result
ru: Результат сохранения

source: Settings saved successfully.
ru: Настройки успешно сохранены.

source: Failed to save settings.
ru: Не удалось сохранить настройки.

source: Unsaved Changes
ru: Несохраненные изменения

source: You have unsaved changes. Do you want to save them before closing?
ru: У вас есть несохраненные изменения. Хотите сохранить их перед закрытием?

source: Discard
ru: Отменить

source: Cancel
ru: Отмена

source: Filter
ru: Фильтр

source: All Models
ru: Все модели

source: Free Models
ru: Бесплатные модели

source: Chat Capabilities
ru: Возможности чата

source: Research Capabilities
ru: Возможности исследования

source: Instruction Following
ru: Следование инструкциям

source: Group:
ru: Группа:

source: All
ru: Все

source: Collapse all providers
ru: Свернуть все провайдеры

source: Zoom in table content (CMD++)
ru: Увеличить содержимое таблицы (CMD++)

source: Zoom out table content (CMD+-)
ru: Уменьшить содержимое таблицы (CMD+-)

source: Reset table content zoom
ru: Сбросить масштаб содержимого таблицы

source: No models available or error fetching models.
ru: Нет доступных моделей или ошибка при получении моделей.

source: An API key is required for
ru: Требуется ключ API для

source: . Please enter it:
ru: . Пожалуйста, введите его:

source: API key is required for
ru: Требуется ключ API для

source: Failed to fetch models for
ru: Не удалось получить модели для

source: Provider and Model Information
ru: Информация о провайдере и модели

source: Workshop
ru: Мастерская

source: New Chat
ru: Новый чат

source: Type your message here...
ru: Введите ваше сообщение здесь...

source: Preview the final prompt
ru: Предпросмотр окончательной подсказки

source: Speech Model:
ru: Модель речи:

source: Language:
ru: Язык:

source: Empty Message
ru: Пустое сообщение

source: Please enter a chat message.
ru: Пожалуйста, введите сообщение чата.

source: Failed to generate response: {}
ru: Не удалось сгенерировать ответ: {}

source: Token Limit Exceeded
ru: Превышен лимит токенов

source: Save Streamed Output
ru: Сохранить потоковый вывод

source: Streaming was interrupted. Would you like to save the output received so far?
ru: Потоковая передача была прервана. Хотите сохранить полученный на данный момент вывод?

source: Thread Error
ru: Ошибка потока

source: An error occurred while stopping the LLM thread: {}
ru: Произошла ошибка при остановке потока LLM: {}

source: Rename
ru: Переименовать

source: Rename Conversation
ru: Переименовать беседу

source: Enter new conversation name:
ru: Введите новое имя беседы:

source: Invalid Name
ru: Недопустимое имя

source: The conversation name cannot be empty. Please try again.
ru: Имя беседы не может быть пустым. Пожалуйста, попробуйте снова.

source: Name Conflict
ru: Конфликт имен

source: A conversation named '{}' already exists. Please choose a different name.
ru: Беседа с именем '{}' уже существует. Пожалуйста, выберите другое имя.

source: Rename Error
ru: Ошибка переименования

source: An error occurred while renaming the conversation: {}. The operation was cancelled to prevent data loss.
ru: Произошла ошибка при переименовании беседы: {}. Операция была отменена для предотвращения потери данных.

source: Delete Conversation
ru: Удалить беседу

source: Are you sure you want to delete '{}'?
ru: Вы уверены, что хотите удалить '{}'?

source: Save Error
ru: Ошибка сохранения

source: Failed to save conversations: {}. Your data is safe in memory, but try saving again later.
ru: Не удалось сохранить беседы: {}. Ваши данные в безопасности в памяти, но попробуйте сохранить снова позже.

source: Transcription Error
ru: Ошибка транскрипции

source: Prompt Preview
ru: Предпросмотр подсказки

source: Zoom In (Cmd+=)
ru: Увеличить (Cmd+=)

source: Zoom Out (Cmd+-)
ru: Уменьшить (Cmd+-)

source: OK
ru: ОК

source: Token Count: 0
ru: Количество токенов: 0

source: Token Count: {}
ru: Количество токенов: {}

source: Token Count: Error ({})
ru: Количество токенов: Ошибка ({})

source: Missing variables for prompt: {}
ru: Отсутствуют переменные для подсказки: {}

source: You are collaborating with the author to write a scene. Write the scene in {pov} point of view, from the perspective of {pov_character}, and in {tense}.
ru: Вы сотрудничаете с автором для написания сцены. Напишите сцену с точки зрения {pov}, от лица {pov_character} и в {tense} времени.

source: Summarize the following chapter for use in a story prompt, covering Goal, Key Events, Character Dev, Info Revealed, Emotional Arc, and Plot Setup. Be conscientious of token usage.
ru: Суммируйте следующую главу для использования в подсказке для истории, охватывая цель, ключевые события, развитие персонажа, раскрытую информацию, эмоциональную арку и подготовку сюжета. Учитывайте использование токенов.

source: Rewrite the passage for clarity.
ru: Перепишите отрывок для большей ясности.

source: I need your help with my project. Please provide creative brainstorming and ideas.
ru: Мне нужна ваша помощь с моим проектом. Пожалуйста, предложите креативные идеи и мозговой штурм.

source: Default {} Prompt
ru: Подсказка по умолчанию {}

source: Select a {} Prompt
ru: Выберите подсказку {}

source: Default Model
ru: Модель по умолчанию

source: Prompts -
ru: Подсказки -

source: Prompts
ru: Подсказки

source: Replicate
ru: Реплицировать

source: This is a read-only default prompt. Create a copy to edit it.
ru: Это подсказка по умолчанию только для чтения. Создайте копию для редактирования.

source: Provider:
ru: Провайдер:

source: Show Model Details
ru: Показать детали модели

source: Model:
ru: Модель:

source: Refresh model list
ru: Обновить список моделей

source: Max Tokens:
ru: Максимум токенов:

source: Temperature:
ru: Температура:

source: Save All
ru: Сохранить все

source: Loading models...
ru: Загрузка моделей...

source: Error fetching models: {}
ru: Ошибка получения моделей: {}

source: Custom...
ru: Пользовательский...

source: Custom Model
ru: Пользовательская модель

source: Enter the model identifier:
ru: Введите идентификатор модели:

source: Default prompt (read-only): LLM settings cannot be modified.
ru: Подсказка по умолчанию (только для чтения): настройки LLM не могут быть изменены.

source: Default prompts are read-only. LLM settings cannot be modified.
ru: Подсказки по умолчанию только для чтения. Настройки LLM не могут быть изменены.

source: Prompts saved successfully.
ru: Подсказки успешно сохранены.

source: Error saving prompts: {}
ru: Ошибка сохранения подсказок: {}

source: New Prompt
ru: Новая подсказка

source: Default prompt (read-only)
ru: Подсказка по умолчанию (только для чтения)

source: Move Up
ru: Переместить вверх

source: Move Down
ru: Переместить вниз

source: Enter prompt name:
ru: Введите имя подсказки:

source: Save Prompt
ru: Сохранить подсказку

source: Cannot save: Either not a prompt or it is a default prompt (read-only).
ru: Невозможно сохранить: либо это не подсказка, либо это подсказка по умолчанию (только для чтения).

source: Prompt '{}' saved successfully.
ru: Подсказка '{}' успешно сохранена.

source: Error saving prompt: {}
ru: Ошибка сохранения подсказки: {}

source: Rename Prompt
ru: Переименовать подсказку

source: Default prompts cannot be renamed.
ru: Подсказки по умолчанию не могут быть переименованы.

source: Enter new prompt name:
ru: Введите новое имя подсказки:

source: Move Prompt
ru: Переместить подсказку

source: Default prompts cannot be moved.
ru: Подсказки по умолчанию не могут быть перемещены.

source: Delete Prompt
ru: Удалить подсказку

source: Default prompts cannot be deleted.
ru: Подсказки по умолчанию не могут быть удалены.

source: Delete prompt '{}'?
ru: Удалить подсказку '{}'?

source: Replicate Prompt
ru: Реплицировать подсказку

source: Enter name for the new prompt:
ru: Введите имя для новой подсказки:

source: Replicated
ru: Реплицировано

source: Prompt replicated. You can now edit the new prompt.
ru: Подсказка реплицирована. Теперь вы можете редактировать новую подсказку.

source: Load Version Error
ru: Ошибка загрузки версии

source: Error loading version: {}
ru: Ошибка загрузки версии: {}

source: Load Projects Error
ru: Ошибка загрузки проектов

source: Error loading projects: {}
ru: Ошибка загрузки проектов: {}

source: Save Projects Error
ru: Ошибка сохранения проектов

source: Error saving projects: {}
ru: Ошибка сохранения проектов: {}

source: Left-click: Open project Right-click: Options (Delete, Export, Stats, Edit Cover)
ru: Левый клик: Открыть проект Правый клик: Опции (Удалить, Экспортировать, Статистика, Редактировать обложку)

source: Rename Project
ru: Переименовать проект

source: Delete Project
ru: Удалить проект

source: Export Project
ru: Экспортировать проект

source: Project Statistics
ru: Статистика проекта

source: Add Book Cover
ru: Добавить обложку книги

source: Project '{}' deleted.
ru: Проект '{}' удален.

source: Delete Project Error
ru: Ошибка удаления проекта

source: Error deleting project: {}
ru: Ошибка удаления проекта: {}

source: Export '{}' functionality will be implemented later.
ru: Функция экспорта '{}' будет реализована позже.

source: Could not automatically find the directory for project '{}'. Please select the project directory manually.
ru: Не удалось автоматически найти директорию для проекта '{}'. Пожалуйста, выберите директорию проекта вручную.

source: Select Project Directory
ru: Выбрать директорию проекта

source: Select Directory for Project '{}'
ru: Выбрать директорию для проекта '{}'

source: User cancelled the project directory selection
ru: Пользователь отменил выбор директории проекта

source: Invalid project directory: {}
ru: Недопустимая директория проекта: {}

source: Statistics Error
ru: Ошибка статистики

source: Error loading project statistics: {} Project: '{}' Current directory: {} Details (for debugging): {}
ru: Ошибка загрузки статистики проекта: {} Проект: '{}' Текущая директория: {} Детали (для отладки): {}

source: Error Adding Cover
ru: Ошибка добавления обложки

source: Error adding book cover: {}
ru: Ошибка добавления обложки книги: {}

source: Error Renaming Project
ru: Ошибка переименования проекта

source: Error renaming project: {}
ru: Ошибка переименования проекта: {}

source: Select Book Cover
ru: Выбрать обложку книги

source: Image Files (*.png *.jpg *.jpeg *.bmp)
ru: Файлы изображений (*.png *.jpg *.jpeg *.bmp)

source: Invalid Image
ru: Недопустимое изображение

source: The selected file is not a valid image.
ru: Выбранный файл не является допустимым изображением.

source: Enter the project's new name:
ru: Введите новое имя проекта:

source: Project '{}' already exists.
ru: Проект '{}' уже существует.

source: Project name is unchanged.
ru: Имя проекта не изменилось.

source: Project {} renamed to '{}'
ru: Проект {} переименован в '{}'

source: Project '{}' directory already exists.
ru: Директория проекта '{}' уже существует.

source: Writingway - Workbench
ru: Writingway - Рабочая панель

source: Click here to configure global options (paths, fonts, themes, etc.)
ru: Нажмите здесь для настройки глобальных опций (пути, шрифты, темы и т.д.)

source: Previous Project
ru: Предыдущий проект

source: Next Project
ru: Следующий проект

source: ＋ New Project
ru: ＋ Новый проект

source: Create a brand-new project
ru: Создать совершенно новый проект

source: Version: {}
ru: Версия: {}

source: No quote available
ru: Нет доступных цитат

source: Unknown
ru: Неизвестно

source: Empty quotes list
ru: Список цитат пуст

source: New Project
ru: Новый проект

source: Enter new project name:
ru: Введите имя нового проекта:

source: Project '{}' created.
ru: Проект '{}' создан.

source: Project creation cancelled.
ru: Создание проекта отменено.

source: Outline and Scene Editor
ru: Редактор структуры и сцен

source: Search and Replace
ru: Поиск и замена

source: Compendium
ru: Компендиум

source: Prompt Options
ru: Опции подсказок

source: Selected prompt not found.
ru: Выбранная подсказка не найдена.

source: No child scene content found to summarize.
ru: Не найдено содержимого дочерних сцен для суммирования.

source: Generating summary, please wait...
ru: Генерация сводки, пожалуйста, подождите...

source: Select Summary Prompt
ru: Выбрать подсказку для сводки

source: Please select a summary prompt.
ru: Пожалуйста, выберите подсказку для сводки.

source: Please select an Act or Chapter (not a Scene).
ru: Пожалуйста, выберите акт или главу (не сцену).

source: LLM returned no output.
ru: LLM не вернул никакого вывода.

source: Summary generated successfully.
ru: Сводка успешно сгенерирована.

source: Summary
ru: Сводка

source: Summary Error
ru: Ошибка сводки

source: Third Person Limited
ru: Третье лицо ограниченное

source: Character
ru: Персонаж

source: Present Tense
ru: Настоящее время

source: Provide either uuid or hierarchy, not both
ru: Укажите либо uuid, либо иерархию, но не оба

source: Either uuid or hierarchy must be provided
ru: Должен быть указан либо uuid, либо иерархия

source: An Act named '{}' already exists. Please choose a unique name.
ru: Акт с именем '{}' уже существует. Пожалуйста, выберите уникальное имя.

source: This is the summary for {}.
ru: Это сводка для {}.

source: A Chapter named '{}' already exists in Act '{}'. Please choose a unique name.
ru: Глава с именем '{}' уже существует в акте '{}'. Пожалуйста, выберите уникальное имя.

source: A Scene named '{}' already exists in Chapter '{}' of Act '{}'. Please choose a unique name.
ru: Сцена с именем '{}' уже существует в главе '{}' акта '{}'. Пожалуйста, выберите уникальное имя.

source: A {} named '{}' already exists {}. Please choose a unique name.
ru: {} с именем '{}' уже существует {}. Пожалуйста, выберите уникальное имя.

source: Rewrite Selected Text
ru: Переписать выделенный текст

source: Original Text:
ru: Исходный текст:

source: Select Rewrite Prompt:
ru: Выбрать подсказку для переписывания:

source: Rewrite
ru: Переписать

source: No rewrite prompts found.
ru: Подсказки для переписывания не найдены.

source: Generate Rewrite
ru: Сгенерировать переписывание

source: Rewritten Text:
ru: Переписанный текст:

source: Apply
ru: Применить

source: Generate
ru: Сгенерировать

source: Selected prompt has no text.
ru: В выбранной подсказке нет текста.

source: Error sending prompt to LLM: {}
ru: Ошибка отправки подсказки в LLM: {}

source: No rewritten text to apply.
ru: Нет переписанного текста для применения.

source: Add Act
ru: Добавить акт

source: Enter act name:
ru: Введите имя акта:

source: Add Chapter
ru: Добавить главу

source: Enter chapter name:
ru: Введите имя главы:

source: Add Scene
ru: Добавить сцену

source: Enter scene name:
ru: Введите имя сцены:

source: Enter new name:
ru: Введите новое имя:

source: Project: {}
ru: Проект: {}

source: Select a compendium entry to view...
ru: Выберите запись компендиума для просмотра...

source: Words: {}
ru: Слов: {}

source: Last Saved: {}
ru: Последнее сохранение: {}

source: Enter scene content...
ru: Введите содержимое сцены...

source: Enter summary for {}...
ru: Введите сводку для {}...

source: Manual Save
ru: Ручное сохранение

source: Please select a scene for manual save.
ru: Пожалуйста, выберите сцену для ручного сохранения.

source: There is no content to save.
ru: Нет содержимого для сохранения.

source: Scene manually saved
ru: Сцена сохранена вручную

source: Scene autosaved
ru: Сцена автоматически сохранена

source: Backup Versions
ru: Резервные версии

source: Please select a scene to view backups.
ru: Пожалуйста, выберите сцену для просмотра резервных копий.

source: Backup Loaded
ru: Резервная копия загружена

source: Backup loaded from: {}
ru: Резервная копия загружена из: {}

source: Custom POV
ru: Пользовательская точка зрения

source: Enter custom POV:
ru: Введите пользовательскую точку зрения:

source: Custom POV Character
ru: Пользовательский персонаж точки зрения

source: Enter custom POV Character:
ru: Введите пользовательского персонажа точки зрения:

# verb_tense
source: Custom Tense
ru: Пользовательское время

# verb_tense
source: Enter custom Tense:
ru: Введите пользовательское время:

source: POV: {}
ru: Точка зрения: {}

source: POV Character: {}
ru: Персонаж точки зрения: {}

# verb_tense
source: Tense: {}
ru: Время: {}

source: LLM Prompt
ru: Подсказка LLM

source: Please enter some action beats before sending.
ru: Пожалуйста, введите несколько ритмов действия перед отправкой.

source: Please select a prompt.
ru: Пожалуйста, выберите подсказку.

source: Generating summary to fit token limit…
ru: Генерация сводки в пределах лимита токенов…

source: Third Person
ru: Третье лицо

source: Summary generated. Edit if needed, then resend.
ru: Сводка сгенерирована. Отредактируйте при необходимости и отправьте повторно.

source: LLM Response
ru: Ответ LLM

source: The LLM did not return any text. Possible token limit reached or an error occurred.
ru: LLM не вернул текст. Возможно, достигнут лимит токенов или произошла ошибка.

source: An error occurred while stopping the LLM: {}
ru: Произошла ошибка при остановке LLM: {}

source: Apply Preview
ru: Применить предпросмотр

source: No preview text to apply.
ru: Нет текста предпросмотра для применения.

source: Error: {}
ru: Ошибка: {}

source: No Act or Chapter selected.
ru: Не выбран акт или глава.

source: Summary saved successfully
ru: Сводка успешно сохранена

source: Summary saved successfully.
ru: Сводка успешно сохранена.

source: Failed to save summary.
ru: Не удалось сохранить сводку.

source: TTS Warning
ru: Предупреждение TTS

source: There is no text to read.
ru: Нет текста для чтения.

source: No text selected to rewrite.
ru: Не выбран текст для переписывания.

source: -- Select Character --
ru: -- Выберите персонажа --

source: Create Summary
ru: Создать сводку

source: Save Summary
ru: Сохранить сводку

source: LLM output preview will appear here...
ru: Предпросмотр вывода LLM появится здесь...

source: Appends the LLM's output to your current scene
ru: Добавляет вывод LLM к вашей текущей сцене

source: Include Action Beats
ru: Включить ритмы действия

source: Include the text from the Action Beats field in the scene text
ru: Включить текст из поля ритмов действия в текст сцены

source: Enter your action beats here...
ru: Введите ваши ритмы действия здесь...

source: Sends the action beats to the LLM
ru: Отправляет ритмы действия в LLM

source: Stop the LLM processing
ru: Остановить обработку LLM

source: Toggle context panel
ru: Переключить панель контекста

source: POV
ru: Точка зрения

source: First Person
ru: Первое лицо

source: Omniscient
ru: Всеведущий

source: POV Character
ru: Персонаж точки зрения

source: Tense
ru: Время

source: Past Tense
ru: Прошедшее время

source: Tense: {}
ru: Время: {}

source: The story is too long. Please edit the summary below:
ru: История слишком длинная. Пожалуйста, отредактируйте сводку ниже:

source: Use This Summary
ru: Использовать эту сводку

source: Truncate Story
ru: Усечь историю

source: Tokens: Calculating...
ru: Токены: Вычисление...

source: Tokens: {}/{}
ru: Токены: {}/{}

source: Empty Summary
ru: Пустая сводка

source: Please provide a summary before proceeding.
ru: Пожалуйста, предоставьте сводку перед продолжением.

# status
source: To Do
ru: Сделать

# status
source: In Progress
ru: В процессе

# status
source: Final Draft
ru: Окончательный черновик

source: Status
ru: Статус

source: Set Scene Status
ru: Установить статус сцены

source: Global Actions
ru: Глобальные действия

source: Workshop Chat
ru: Чат мастерской

source: Open Whisper
ru: Открыть Whisper

source: Open Web with LLM
ru: Открыть веб с LLM

source: Open Internet Archive
ru: Открыть Интернет-архив

source: Focus Mode
ru: Режим фокуса

source: Bold
ru: Жирный

source: Italic
ru: Курсив

source: Underline
ru: Подчеркнутый

source: Play TTS (or Stop)
ru: Воспроизвести TTS (или остановить)

source: Align Left
ru: Выровнять по левому краю

source: Center Align
ru: Выровнять по центру

source: Align Right
ru: Выровнять по правому краю

source: Show Backups
ru: Показать резервные копии

source: Analysis Editor
ru: Редактор анализа

source: Spell check:
ru: Проверка орфографии:

source: Select a node to edit...
ru: Выберите узел для редактирования...

source: Additional Dictionaries
ru: Дополнительные словари

source: For more dictionaries, please visit:<br><a href="https://github.com/LibreOffice/dictionaries">https://github.com/LibreOffice/dictionaries</a><br>Paste the .aff and .dic file into the folder:<br>Writingway/assets/dictionaries
ru: Для получения дополнительных словарей посетите:<br><a href="https://github.com/LibreOffice/dictionaries">https://github.com/LibreOffice/dictionaries</a><br>Скопируйте файлы .aff и .dic в папку:<br>Writingway/assets/dictionaries

source: Suggestions
ru: Предложения

source: (No suggestions)
ru: (Нет предложений)

source: Undo replacement
ru: Отменить замену

source: Search in scenes...
ru: Поиск в сценах...

source: Search options
ru: Параметры поиска

source: Regex Search
ru: Поиск с регулярным выражением

source: Show Replace
ru: Показать замену

source: Replace with...
ru: Заменить на...

source: Replace current match
ru: Заменить текущее совпадение

source: Replace all matches
ru: Заменить все совпадения

source: Previous match
ru: Предыдущее совпадение

source: Next match
ru: Следующее совпадение
